logical comparisons:

- eq (equivalent to ==) — equals to
- ne (equivalent to !=) — not equals to
- le (equivalent to <=) — less than or equals to
- lt (equivalent to <) — less than
- ge (equivalent to >=) — greater than or equals to
- gt (equivalent to >) — greater than

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({
    'one': pd.Series(np.random.randn(3), index=['a','b','c']),
    'two': pd.Series(np.random.randn(4), index=['a','b','c','d']),
    'three': pd.Series(np.random.randn(3), index=['b','c','d'])})

In [4]:
df2 = df.copy()

In [5]:
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [6]:
df.ge(df2)

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [7]:
df.ne(df2)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [8]:
(df >0).all()

one      False
two      False
three    False
dtype: bool

In [9]:
(df>0).any()

one      True
two      True
three    True
dtype: bool

In [10]:
(df>0).any().any()

True

In [11]:
df['one']

a   -1.663724
b    1.157698
c   -0.526752
d         NaN
Name: one, dtype: float64

In [12]:
df

        one       two     three
a -1.663724 -1.857193       NaN
b  1.157698  0.093958 -0.727448
c -0.526752  0.980533  1.608935
d       NaN -0.764655  0.588832

In [13]:
df[['one']]

        one
a -1.663724
b  1.157698
c -0.526752
d       NaN

In [14]:
pd.Series([True]).bool()

True

In [15]:
pd.Series([False]).bool()

False

In [16]:
pd.DataFrame([[True]]).bool()

True

In [17]:
pd.DataFrame([[False]]).bool()

False

In [18]:
pd.Series

pandas.core.series.Series

In [19]:
pd.Series(['foo','bar','baz'])=='foo'

0     True
1    False
2    False
dtype: bool

In [21]:
pd.Series(['foo','bar','baz']) == pd.Index(['foo','bar','qux'])

0     True
1     True
2    False
dtype: bool

In [22]:
df + df

        one       two     three
a -3.327449 -3.714386       NaN
b  2.315395  0.187916 -1.454896
c -1.053504  1.961067  3.217870
d       NaN -1.529311  1.177664

In [24]:
df*2

        one       two     three
a -3.327449 -3.714386       NaN
b  2.315395  0.187916 -1.454896
c -1.053504  1.961067  3.217870
d       NaN -1.529311  1.177664

In [28]:
(df + df == df*2).all().all()

False

In [29]:
(df + df == df*2).all()

one      False
two       True
three    False
dtype: bool

In [30]:
(df + df == df*2)

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [31]:
# because np.nan == np.nan is FALSE

# Descriptive Statistics

In [33]:
df.mean(0) # aggregation for each column (take the mean of all the indices in each column)

one     -0.344260
two     -0.386839
three    0.490106
dtype: float64

In [35]:
df.mean(1) # aggregation for each index (take the mean of all the columns in each index)

a   -1.760459
b    0.174736
c    0.687572
d   -0.087912
dtype: float64

In [36]:
ts_stand = (df - df.mean()) / df.std()

In [37]:
ts_stand.std()

one      1.0
two      1.0
three    1.0
dtype: float64